<?php
/* //
Holiday Classes Wrapper and Regularizer

$h = new PublicHoliday();
$h = new PublicHoliday(array('year'=>2014,'month'=>1,'day'=>13));
$h->is_holiday(2014,1,13);
// */
require_once("ClassTemplate.php");

class PublicHoliday extends ClassTemplate {
public $y = NULL ;
public $m = NULL ;
public $d = NULL ;
public $holidays = NULL ;
public $holidays_2007to2020 = NULL ;
public $custom_holidays = NULL ;
public $holiday_class = NULL ;
public $params = NULL ;
function __construct($param=NULL) {
 require_once('class.HashAccessor.php');
 $this->param( parse_args(
  array(
   'type'		 => 'Holiday',	 //'static', 'Holiday' or 'public_holiday_2.0' (deprecated)
   'holidays'	 => NULL,		 // assumed array('2013-1-5' => 'Holiday Name') other formats ignored
   'year'		 => date('Y'),
   'month'		 => date('n'),
   'day'		 => date('j')
  ), (array) $param
 ) );
 $this->set($this->param('year'),$this->param('month'),$this->param('day'));
 $this->custom_holidays = (array) $this->param('holidays');
 $this->setup_holiday_data();
// if (is_specific_user_logged_in(1)) { my_print_r($this->holidays); }
 return $this;
}


function setup_holiday_data($_static_data=NULL) {
 switch ($this->param('type')) {
  case 'public_holiday_2.0':
   require_once('public_holiday_2.0.php');
   break
  ;
  case 'Holiday':
   require_once('Holiday.php');
   $this->holiday_class = new Holiday;
   break
  ;
  case 'static':
   $this->set_static_holidays($_static_data);
   break
  ;
 }
 return $this;
}


function is_holiday($y=NULL,$m=NULL,$d=NULL) {
 extract ($this->date_as_array($y,$m,$d));
 $h = FALSE;
 $datestr = sprintf("%d-%d-%d", $y, $m, $d);
 ;
 switch ($this->param('type')) {
  case 'public_holiday_2.0' :
   $d = function_exists('public_holiday') ? public_holiday($y,$m,$d) : NULL ;
   $h = (isset($d['rc']) && $d['rc']) ? true : false;
   break
  ;
  case 'Holiday' :
   $c = array();
   if (isset($this->custom_holidays[$datestr]) && $this->custom_holidays[$datestr]) {
    $c[$d] = $this->custom_holidays[$datestr];
   }
   $hs = $this->holiday_class->get($y, $m, $c);
   $h = in_array($d, array_keys($hs));
   break
  ;
  case 'static' :
   $h = in_array($datestr, array_keys($this->holidays));
   break
  ;
 }
 return $h
 ;
}


public function date_as_array($y=null,$m=null,$d=null) {
 $ymd = parse_args(
  parse_args(
   array(
    'y'=> intval( date('Y') ),
    'm'=> intval( date('n') ),
    'd'=> intval( date('j') )
   ),
   array(
    'y'=> $this->y,
	'm'=> $this->m,
	'd'=> $this->d
   )
  ), array('y'=>$y, 'm'=>$m, 'd'=>$d)
 );
 return $ymd; 
}


public function set($y=null,$m=null,$d=null) {
 $ymd = $this->date_as_array($y,$m,$d);
 foreach ($ymd as $k=>$v) $this->{$k} = $v;
 $this->date = strtotime(vsprintf('%s-%s-%s', array($ymd['y'],$ymd['m'],$ymd['d'])));
 return $this;
}

public function set_static_holidays($param=NULL) {
 $this->holidays_2007to2020 = array(
 '2007-1-1'=>'元日',
 '2007-1-8'=>'成人の日',
 '2007-2-11'=>'建国記念の日',
 '2007-2-12'=>'振替休日',
 '2007-3-21'=>'春分の日',
 '2007-4-29'=>'昭和の日',
 '2007-4-30'=>'振替休日',
 '2007-5-3'=>'憲法記念日',
 '2007-5-4'=>'みどりの日',
 '2007-5-5'=>'こどもの日',
 '2007-7-16'=>'海の日',
 '2007-9-17'=>'敬老の日',
 '2007-9-23'=>'秋分の日',
 '2007-9-24'=>'振替休日',
 '2007-10-8'=>'体育の日',
 '2007-11-3'=>'文化の日',
 '2007-11-23'=>'勤労感謝の日',
 '2007-12-23'=>'天皇誕生日',
 '2007-12-24'=>'振替休日',
 
 '2008-1-1'=>'元日',
 '2008-1-14'=>'成人の日',
 '2008-2-11'=>'建国記念の日',
 '2008-3-20'=>'春分の日',
 '2008-4-29'=>'昭和の日',
 '2008-5-3'=>'憲法記念日',
 '2008-5-4'=>'みどりの日',
 '2008-5-5'=>'こどもの日',
 '2008-5-6'=>'振替休日',
 '2008-7-21'=>'海の日',
 '2008-9-15'=>'敬老の日',
 '2008-9-23'=>'秋分の日',
 '2008-10-13'=>'体育の日',
 '2008-11-3'=>'文化の日',
 '2008-11-23'=>'勤労感謝の日',
 '2008-11-24'=>'振替休日',
 '2008-12-23'=>'天皇誕生日',
 
 '2009-1-1'=>'元日',
 '2009-1-12'=>'成人の日',
 '2009-2-11'=>'建国記念の日',
 '2009-3-20'=>'春分の日',
 '2009-4-29'=>'昭和の日',
 '2009-5-3'=>'憲法記念日',
 '2009-5-4'=>'みどりの日',
 '2009-5-5'=>'こどもの日',
 '2009-5-6'=>'振替休日',
 '2009-7-20'=>'海の日',
 '2009-9-21'=>'敬老の日',
 '2009-9-22'=>'国民の休日',
 '2009-9-23'=>'秋分の日',
 '2009-10-12'=>'体育の日',
 '2009-11-3'=>'文化の日',
 '2009-11-23'=>'勤労感謝の日',
 '2009-12-23'=>'天皇誕生日',
 
 '2010-1-1'=>'元日',
 '2010-1-11'=>'成人の日',
 '2010-2-11'=>'建国記念の日',
 '2010-3-21'=>'春分の日',
 '2010-3-22'=>'振替休日',
 '2010-4-29'=>'昭和の日',
 '2010-5-3'=>'憲法記念日',
 '2010-5-4'=>'みどりの日',
 '2010-5-5'=>'こどもの日',
 '2010-7-19'=>'海の日',
 '2010-9-20'=>'敬老の日',
 '2010-9-23'=>'秋分の日',
 '2010-10-11'=>'体育の日',
 '2010-11-3'=>'文化の日',
 '2010-11-23'=>'勤労感謝の日',
 '2010-12-23'=>'天皇誕生日',
 
 '2011-1-1'=>'元日',
 '2011-1-10'=>'成人の日',
 '2011-2-11'=>'建国記念の日',
 '2011-3-21'=>'春分の日',
 '2011-4-29'=>'昭和の日',
 '2011-5-3'=>'憲法記念日',
 '2011-5-4'=>'みどりの日',
 '2011-5-5'=>'こどもの日',
 '2011-7-18'=>'海の日',
 '2011-9-19'=>'敬老の日',
 '2011-9-23'=>'秋分の日',
 '2011-10-10'=>'体育の日',
 '2011-11-3'=>'文化の日',
 '2011-11-23'=>'勤労感謝の日',
 '2011-12-23'=>'天皇誕生日',
 
 '2012-1-1'=>'元日',
 '2012-1-2'=>'振替休日',
 '2012-1-9'=>'成人の日',
 '2012-2-11'=>'建国記念の日',
 '2012-3-20'=>'春分の日',
 '2012-4-29'=>'昭和の日',
 '2012-4-30'=>'振替休日',
 '2012-5-3'=>'憲法記念日',
 '2012-5-4'=>'みどりの日',
 '2012-5-5'=>'こどもの日',
 '2012-7-16'=>'海の日',
 '2012-9-17'=>'敬老の日',
 '2012-9-22'=>'秋分の日',
 '2012-10-8'=>'体育の日',
 '2012-11-3'=>'文化の日',
 '2012-11-23'=>'勤労感謝の日',
 '2012-12-23'=>'天皇誕生日',
 '2012-12-24'=>'振替休日',
 
 '2013-1-1'=>'元日',
 '2013-1-14'=>'成人の日',
 '2013-2-11'=>'建国記念の日',
 '2013-3-20'=>'春分の日',
 '2013-4-29'=>'昭和の日',
 '2013-5-3'=>'憲法記念日',
 '2013-5-4'=>'みどりの日',
 '2013-5-5'=>'こどもの日',
 '2013-5-6'=>'振替休日',
 '2013-7-15'=>'海の日',
 '2013-9-16'=>'敬老の日',
 '2013-9-23'=>'秋分の日',
 '2013-10-14'=>'体育の日',
 '2013-11-3'=>'文化の日',
 '2013-11-4'=>'振替休日',
 '2013-11-23'=>'勤労感謝の日',
 '2013-12-23'=>'天皇誕生日',
 
 '2014-1-1'=>'元日',
 '2014-1-13'=>'成人の日',
 '2014-2-11'=>'建国記念の日',
 '2014-3-21'=>'春分の日',
 '2014-4-29'=>'昭和の日',
 '2014-5-3'=>'憲法記念日',
 '2014-5-4'=>'みどりの日',
 '2014-5-5'=>'こどもの日',
 '2014-5-6'=>'振替休日',
 '2014-7-21'=>'海の日',
 '2014-9-15'=>'敬老の日',
 '2014-9-23'=>'秋分の日',
 '2014-10-13'=>'体育の日',
 '2014-11-3'=>'文化の日',
 '2014-11-23'=>'勤労感謝の日',
 '2014-11-24'=>'振替休日',
 '2014-12-23'=>'天皇誕生日',
 
 '2015-1-1'=>'元日',
 '2015-1-12'=>'成人の日',
 '2015-2-11'=>'建国記念の日',
 '2015-3-21'=>'春分の日',
 '2015-4-29'=>'昭和の日',
 '2015-5-3'=>'憲法記念日',
 '2015-5-4'=>'みどりの日',
 '2015-5-5'=>'こどもの日',
 '2015-5-6'=>'振替休日',
 '2015-7-20'=>'海の日',
 '2015-9-21'=>'敬老の日',
 '2015-9-22'=>'国民の休日',
 '2015-9-23'=>'秋分の日',
 '2015-10-12'=>'体育の日',
 '2015-11-3'=>'文化の日',
 '2015-11-23'=>'勤労感謝の日',
 '2015-12-23'=>'天皇誕生日',
 
 '2016-1-1'=>'元日',
 '2016-1-11'=>'成人の日',
 '2016-2-11'=>'建国記念の日',
 '2016-3-20'=>'春分の日',
 '2016-3-21'=>'振替休日',
 '2016-4-29'=>'昭和の日',
 '2016-5-3'=>'憲法記念日',
 '2016-5-4'=>'みどりの日',
 '2016-5-5'=>'こどもの日',
 '2016-7-18'=>'海の日',
 '2016-9-19'=>'敬老の日',
 '2016-9-22'=>'秋分の日',
 '2016-10-10'=>'体育の日',
 '2016-11-3'=>'文化の日',
 '2016-11-23'=>'勤労感謝の日',
 '2016-12-23'=>'天皇誕生日',
 
 '2017-1-1'=>'元日',
 '2017-1-2'=>'振替休日',
 '2017-1-9'=>'成人の日',
 '2017-2-11'=>'建国記念の日',
 '2017-3-20'=>'春分の日',
 '2017-4-29'=>'昭和の日',
 '2017-5-3'=>'憲法記念日',
 '2017-5-4'=>'みどりの日',
 '2017-5-5'=>'こどもの日',
 '2017-7-17'=>'海の日',
 '2017-9-18'=>'敬老の日',
 '2017-9-23'=>'秋分の日',
 '2017-10-9'=>'体育の日',
 '2017-11-3'=>'文化の日',
 '2017-11-23'=>'勤労感謝の日',
 '2017-12-23'=>'天皇誕生日',
 
 '2018-1-1'=>'元日',
 '2018-1-8'=>'成人の日',
 '2018-2-11'=>'建国記念の日',
 '2018-2-12'=>'振替休日',
 '2018-3-21'=>'春分の日',
 '2018-4-29'=>'昭和の日',
 '2018-4-30'=>'振替休日',
 '2018-5-3'=>'憲法記念日',
 '2018-5-4'=>'みどりの日',
 '2018-5-5'=>'こどもの日',
 '2018-7-16'=>'海の日',
 '2018-9-17'=>'敬老の日',
 '2018-9-23'=>'秋分の日',
 '2018-9-24'=>'振替休日',
 '2018-10-8'=>'体育の日',
 '2018-11-3'=>'文化の日',
 '2018-11-23'=>'勤労感謝の日',
 '2018-12-23'=>'天皇誕生日',
 '2018-12-24'=>'振替休日',
 
 '2019-1-1'=>'元日',
 '2019-1-14'=>'成人の日',
 '2019-2-11'=>'建国記念の日',
 '2019-3-21'=>'春分の日',
 '2019-4-29'=>'昭和の日',
 '2019-5-3'=>'憲法記念日',
 '2019-5-4'=>'みどりの日',
 '2019-5-5'=>'こどもの日',
 '2019-5-6'=>'振替休日',
 '2019-7-15'=>'海の日',
 '2019-9-16'=>'敬老の日',
 '2019-9-23'=>'秋分の日',
 '2019-10-14'=>'体育の日',
 '2019-11-3'=>'文化の日',
 '2019-11-4'=>'振替休日',
 '2019-11-23'=>'勤労感謝の日',
 '2019-12-23'=>'天皇誕生日',
 
 '2020-1-1'=>'元日',
 '2020-1-13'=>'成人の日',
 '2020-2-11'=>'建国記念の日',
 '2020-3-20'=>'春分の日',
 '2020-4-29'=>'昭和の日',
 '2020-5-3'=>'憲法記念日',
 '2020-5-4'=>'みどりの日',
 '2020-5-5'=>'こどもの日',
 '2020-5-6'=>'振替休日',
 '2020-7-20'=>'海の日',
 '2020-9-21'=>'敬老の日',
 '2020-9-22'=>'秋分の日',
 '2020-10-12'=>'体育の日',
 '2020-11-3'=>'文化の日',
 '2020-11-23'=>'勤労感謝の日',
 '2020-12-23'=>'天皇誕生日'
 );
 $this->holidays = array_merge((array) $this->holidays_2007to2020, (array) $param);
}
}

